In [3]:
#Task1
def fibonacci(n):
    """Generate the first n Fibonacci numbers and return them as a list."""
    if n <= 0:
        return []
    elif n == 1:
        return [0]
    elif n == 2:
        return [0, 1]

    fib_sequence = [0, 1]
    for i in range(2, n):
        next_number = fib_sequence[-1] + fib_sequence[-2]
        fib_sequence.append(next_number)

    return fib_sequence

print(fibonacci(10))

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [4]:
#Task2
def is_prime(num):
   """Check if a given number is a prime number."""
   if num<=1:
    return False
   for i in range(2,int(num**0.5)+1):
    if num%i==0:
      return False
   return True

In [5]:
print(is_prime(11))

True

In [6]:
print(is_prime(14))

False

In [7]:
#Task3
import pandas as pd
data = {
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Sales': [200, 220, 210, 215, 225],
    'Region': ['North', 'South', 'East', 'West', 'North'],
    'Manager': ['John', 'Jane', 'Joe', 'Jake', 'John']
}

df = pd.DataFrame(data)

In [8]:
# 1First 5 rows
print("First 5 rows of the DataFrame:")
print(df.head())

First 5 rows of the DataFrame:
         Date  Sales Region Manager
0  2024-01-01    200  North    John
1  2024-01-02    220  South    Jane
2  2024-01-03    210   East     Joe
3  2024-01-04    215   West    Jake
4  2024-01-05    225  North    John

In [9]:
#2
df['Profit'] = df['Sales']*0.1
print("DataFrame with Profit column:")
print(df)

DataFrame with Profit column:
         Date  Sales Region Manager  Profit
0  2024-01-01    200  North    John    20.0
1  2024-01-02    220  South    Jane    22.0
2  2024-01-03    210   East     Joe    21.0
3  2024-01-04    215   West    Jake    21.5
4  2024-01-05    225  North    John    22.5

In [10]:
#3
total_sales_by_region = df.groupby('Region')['Sales'].sum()
print("\nTotal sales by region:")
print(total_sales_by_region)

Total sales by region:
Region
East     210
North    425
South    220
West     215
Name: Sales, dtype: int64

In [11]:
#4
average_sales_by_region = df.groupby('Region')['Sales'].mean()
region_with_highest_avg_sales = average_sales_by_region.idxmax()
print("\nRegion with the highest average sales:")
print(region_with_highest_avg_sales)

Region with the highest average sales:
South

In [12]:
#Task4
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
titanic_df = pd.read_csv(url)
print("First 5 rows of the Titanic DataFrame:")
print(titanic_df.head())

First 5 rows of the Titanic DataFrame:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [13]:
#2
print("Summary statistics of the DataFrame:")
print(titanic_df.describe())

Summary statistics of the DataFrame:
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [14]:
#3
print("Count of null values in each column:")
print(titanic_df.isnull().sum())

Count of null values in each column:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
#4
titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)
print("\nFilled null values in 'Age' column with mean age.")

Filled null values in 'Age' column with mean age.

In [16]:
#5
titanic_df.dropna(subset=['Embarked'], inplace=True)
print("\nDropped rows where 'Embarked' is null.")

Dropped rows where 'Embarked' is null.

In [17]:
#6
titanic_df['FamilySize'] = titanic_df['SibSp'] + titanic_df['Parch']
print("\nAdded 'FamilySize' column.")

Added 'FamilySize' column.

In [18]:
#7
titanic_df['Sex'] = titanic_df['Sex'].map({'male': 0, 'female': 1})
print("\nConverted 'Sex' column to numerical values.")

Converted 'Sex' column to numerical values.

In [19]:
#8
average_fare_by_pclass = titanic_df.groupby('Pclass')['Fare'].mean()
print("\nAverage fare for each class:")
print(average_fare_by_pclass)

Average fare for each class:
Pclass
1    84.193516
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [20]:
#9
most_common_port = titanic_df['Embarked'].mode()[0]
print("\nMost common port of embarkation:")
print(most_common_port)

Most common port of embarkation:
S

In [21]:
#10
survival_rate_pivot = titanic_df.pivot_table(values='Survived', index='Sex', columns='Pclass', aggfunc='mean')
print("\nPivot table showing the survival rate for each combination of 'Sex' and 'Pclass':")
print(survival_rate_pivot)

Pivot table showing the survival rate for each combination of 'Sex' and 'Pclass':
Pclass         1         2         3
Sex
0       0.368852  0.157407  0.135447
1       0.967391  0.921053  0.500000